Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_DevelopiOSAppsSwift/DevelopiOSAppsSwift-level2.tmx
Source language: en_us
Languages: ja

source: If the identifier is nil, the nil-coalescing operator (??) replaces it with an empty string ("").
ja: 識別子がnilならば、nil合体演算子（??）はそれを空の文字列（""）と置き換えます。

source: If the initializer does fail, you have a bug in your code.
ja: イニシャライザが失敗するならば、あなたのコードにはバグがあります。

source: If the initializer is working as expected, these calls to init(name:, photo:, rating:) should fail.
ja: イニシャライザが予想するように機能しているならば、それらは init(name:, photo:, rating:)に対する呼び出しに失敗するはずです。

source: If the initializer is working as expected, these calls to init(name:, photo:, rating:) should succeed.
ja: イニシャライザが予想するように機能しているならば、それらは init(name:, photo:, rating:)に対する呼び出しを成功するはずです。

source: If the last item in the property list is an array, make sure the array is collapsed.
ja: プロパティリストの中の最後の項目が配列ならば、その配列が折りたたまれることを確認してください。

source: If the layout does not behave as you expect, click the Resolve Auto Layout Issues button to bring up a menu of debug commands.
ja: レイアウトがあなたが期待するように振舞わないならば、Resolve Auto Layout Issuesボタンをクリックすることでデバックコマンドのメニューを画面に出してください。

source: If the outline view is collapsed, click the toggle to expand the outline view.
ja: アウトラインビューが折りたたまれているならば、切替ボタンをクリックしてアウトラインビューを展開してください。

source: If the project navigator isn’t open, click the leftmost button in the navigator selector bar.
ja: プロジェクトナビゲータが開いていないならば、ナビゲータ選択バーの中の一番左のボタンをクリックしてください。

source: If the rating is greater than 1, you calculate the hint using string interpolation.
ja: 格付けが1より大きいならば、あなたはヒントを文字列補間を使って算出します。

source: If the user is adding an item to the meal list, you don’t need to change the meal detail scene’s appearance.
ja: ユーザが項目を食事リストに加えているならば、あなたは食事詳細シーンの外観を変える必要はありません。

source: If the user tapped the star that corresponds with the current rating, you reset the control’s rating property to 0.
ja: 現在の格付けに相当する星をユーザがタップしたならば、あなたはコントロールの持つratingプロパティをゼロへとリセットします。

source: If the user taps the rightmost filled in star (the star associated with the current rating), the rating is cleared and all stars are displayed as empty.
ja: ユーザが星で塗りつぶされた最も右（現在の格付けと関連する星）をタップするならば、格付けは消去されてすべての星は空として表示されます。

source: If the view controller has been pushed onto a navigation stack, this property contains a reference to the stack’s navigation controller.
ja: ビューコントローラがナビゲーションスタック上へとプッシュされ終わったならば、このプロパティはスタックの持つナビゲーションコントローラへの参照を格納します。

source: If they are not, the else statement is executed.
ja: もしそれらが違うならば、else文が実行されます。

source: If they do, it represents either a bug in your app that needs to be fixed at design time.
ja: それらがそうするならば、それはどちらもあなたのアプリでのバグ（不具合）に相当し、それは設計時に修正される必要があります。

source: If they tap the Save button, you’ll update both the meal’s data in the model and its appearance in the meal list.
ja: 彼らがSaveボタンをタップするならば、あなたは食事の持つデータをモデルにおいて、そしてそれの外観を食事リストにおいて更新します。

source: If this is the first time you’ve launched Xcode, it may ask you to agree to the user agreement and to download additional components.
ja: これがあなたがXcodeを起動する最初の時ならば、それは利用者契約に同意するかあなたに尋ねてから追加コンポーネントをダウンロードするでしょう。

source: If you add a few new meals and quit the app, the meals you added will be there next time you open the app.
ja: あなたがいくつかの新しい食事を加えてアプリを終了したならば、あなたが加えた食事は次回あなたがアプリを開いた時にそこにあるでしょう。

source: If you add an item to a collapsed array, it adds a sibling to the array.
ja: あなたがある項目を折りたたまれた配列に加えるならば、それはその配列の兄弟として加わります。

source: If you add an item to an expanded array, it adds a child item.
ja: あなたがある項目を展開された配列に加えるならば、それは子項目として加わります。

source: If you are an individual or part of an organization that is a member of the Apple Developer Program, you can select that team here.
ja: あなたがAppleデベロッパプログラムのいちメンバーである個別の組織または組織の一部ならば、あなたはチームをここで選択できます。

source: If you are editing an existing meal, you need to display the meal’s data in the meal detail scene.
ja: あなたが既存の食事を編集しているならば、あなたは食事の持つデータを食事詳細シーンにおいて表示する必要があります。

source: If you are getting warnings about misplaced views, select the view controller and press the Update Frames button in the bottom right corner of the canvas.
ja: あなたが誤って設置されたビューについての警告を得ているならば、ビューコントローラを選択してUpdate Framesボタンをキャンバスの下右隅で押してください。

source: If you are getting warnings about misplaced views, use the Update Frames button.
ja: あなたが間違って設置されたビューについての警告を受けているならば、Update Framesボタンを使ってください。

source: If you are not yet comfortable with Swift, complete the Learn to Code exercises in the Swift Playgrounds app.
ja: あなたがまだSwiftに慣れていないならば、Swift Playgroundsアプリにおいて「Learn Code」練習問題を完了してください。

source: If you are using a different version, your screen may look different than what is shown in the screenshots.
ja: あなたが異なるバージョンを使っているならば、あなたの画面は、スクリーンショットで示されるものとは違って見えるかもしれません。

source: If you choose not to enable developer mode, you may be asked for your password later on.
ja: あなたが開発者モードを有効にしないのを選んだならば、あなたはあなたのパスワードを後で聞かれるでしょう。

source: If you click Save, the app does not update the meal.
ja: あなたがSaveをクリックしても、アプリは食事を更新しません。

source: If you click Save, the changes you made should be displayed in the meal list.
ja: あなたがSaveをクリックするならば、あなたがした変更が食事リストで表示されるはずです。

source: If you click the Edit button, the table view goes into editing mode.
ja: あなたがEditボタンをクリックするならば、テーブルビューは編集モードになります。

source: If you click the Edit button, the table view goes into editing mode—but you won’t be able to delete cells yet, because you haven’t implemented that.
ja: あなたがこのEditボタンをクリックするならば、テーブルビューは編集モードにはいります—しかしあなたはまだセルを削除することができません、なぜならあなたがそれを実装していないからです。

source: If you click these icons, Xcode shows additional information about the errors and warnings.
ja: あなたがそれらのアンコンをクリックするならば、Xcodeはエラーと警告について追加情報を示します。

source: If you didn’t add a default photo to your project in a previous lesson, add it now.
ja: あなたが省略時の写真をあなたのプロジェクトに以前のレッスンで加えなかったならば、今それを加えてください。

source: If you don’t get the behavior you expect, use the Auto Layout debugging features to help you.
ja: あなたが期待する挙動を得ないならば、あなたの助けとなる自動レイアウトデバッグ機能を使ってください。

source: If you don’t provide any initializers, Swift classes automatically inherit all of their super class’s designated initializers.
ja: あなたが何らイニシャライザを提供しないならば、Swiftのクラスは自動的にそれらのスーパークラスの持つ指定イニシャライザの全てを継承します。

source: If you don’t see RatingControl as an option in the pop-up menu, make sure you have the stack view selected on the canvas.
ja: あなたがRatingControlをオプションとしてポップアップメニューに見ないならば、あなたがキャンパス上でスタックビューを選択していることを確かめてください。

source: If you don’t see the unwindToMealListWithSender: method in the shortcut menu, make sure that the method has the right signature.
ja: あなたがunwindToMealListWithSender:メソッドをショートカットメニューで見ないならば、そのメソッドが正しいシグネチャを持つことを確認してください。

source: If you don’t see the Object library, click its button, which is the third button from the left in the library selector bar.
ja: オブジェクトライブラリが見えないならば、それのボタンをクリックしてください、それはライブラリ選択バーの左から３番目のボタンです。

source: If you don’t, use com.example.
ja: あなたの組織識別子、あなたがそれを持つならば。あなたが持たないならば、com.exampleを使ってください。

source: If you have, fix them by reading through the warnings or errors that the compiler provides, and then look back over the instructions in this lesson to make sure everything looks the way it’s described here.
ja: あなたがしていたら、それらをコンパイラが提供する警告やエラーをあちこち読んで修正してください、そしてそれからこのレッスンの指示をずっと振り返って、すべてのことがそれがここで説明されるようになっているか確かめてください。

source: If you haven’t explicitly marked an item as file private or private, you can access it from your tests.
ja: あなたがある項目にファイルプライベートまたはプライベートであると明示的に印しないならば、あなたはそれにあなたのテストからアクセス出来ません。

source: If you implement any initializers, you not longer inherit any of the superclasses initializers; however, the superclass can mark one or more of its initializers as required.
ja: あなたが何らかのイニシャライザを実装するならば、あなたはもはやスーパークラスイニシャライザのどれも継承しません；しかしながら、スーパークラスはひとつ以上のそれのイニシャライザをrequiredと印することができます。

source: If you leave the template implementation empty or delete it from your AppDelegate class, you get the default behavior whenever that method is called.
ja: あなたがひな形実装を空のままにしておいたり、それをあなたのAppDelegateクラスから削除したならば、あなたはそのメソッドが呼ばれるたびに省略時の挙動を受け取ります。

source: If you look at the meal list scene in your storyboard, you’ll notice that it shows a single table view cell.
ja: あなたが食事リストシーンをあなたのストーリーボードで観察するならば、あなたはそれがただ１つのテーブルビューセルを表示するのに気づくでしょう。

source: If you look at the rating control in Interface Builder, you’ll notice that it’s displayed as a large, empty rectangle.
ja: あなたが格付けコントロールをInterface Builderで見つけるならば、あなたはそれが大きな、空の長方形として表示されるのに気づくでしょう。

source: If you look through the photos available in the simulator, you’ll notice that it doesn’t include any photos of food.
ja: あなたが利用可能な写真をあちこちシミュレータにおいて見るならば、あなたは食事の写真を何ら含まないことに気づくでしょう。

source: If you need to refer to the concepts you’ve learned throughout the lessons, use the glossary to refresh your memory.
ja: あなたがレッスンを通して学んだ概念を調べる必要があるならば、用語集をあなたの記憶を新たにするのに使ってください。

source: If you programmatically set the button as selected, it will change from the empty star to the filled star.
ja: あなたがプログラム的にボタンを選択されると設定するならば、それは空の星から塗りつぶされた星へと変わるでしょう。

source: If you see the wrong scene in the preview, make sure to select the table view scene by clicking its scene dock.
ja: あなたが間違ったシーンをプレビューで見るならば、そのテーブルビューシーンを選択することをそれのシーンドックをクリックすることで確実にしてください。

source: If you switch to the Main.storyboard and select the RatingControl, you’ll see the Star Size and Star Count settings in the Attributes inspector.
ja: あなたがMain.storyboardに切り替えてRatingControlを選択するならば、あなたは、Star SizeとStar Count設定をAttributesインスペクタで見るでしょう。

source: If you try to drag the table view to the canvas and nothing happens, you’re probably dragging a table view object rather than a table view controller object.
ja: あなたがテープルビューをキャンバスにドラッグすることを試みて何も起きないならば、あなたはおそらくテーブルビューコントローラオブジェクトではなくて、テーブルビューオブジェクトをドラッグしています。

source: If you want more space to work, collapse the project navigator and utility area by clicking the Navigator and Utilities buttons in the Xcode toolbar.
ja: あなたがもっと場所を必要とするならば、プロジェクトナビゲータとユーティリティ区画をNavigatorとUtilitiesボタンをXcodeツールバーにおいてクリックすることで折り畳んでください。

source: If you want to check and see if your interface is adaptive, you need to preview different size screens and different orientations.
ja: あなたのインターフェイスが適応性を持つかどうかを見て確かめたいならば、あなたは異なる大きさの画面と異なる方向でプレビューする必要があります。

source: If you want, you can zoom out using the zoom command at the bottom of the canvas.
ja: あなたが望むならば、あなたはズームコマンドをキャンバスの一番下で使って表示を拡大縮小できます。

source: If you write unit tests that are long or complicated, it’ll be harder to track down exactly what’s going wrong.
ja: あなたがユニットテストを長く難解に書いたならば、何が間違っているか正確に見つけ出すのが困難になるでしょう。

source: If your app’s navigation flow is set up properly, this else case should never execute.
ja: あなたのアプリの持つナビゲーションフローが正しく準備されるならば、このelseは決して実行されないはずです。

source: If your storyboard is set up correctly, and the cellIdentifier matches the identifier from your storyboard, then the downcast should never fail.
ja: あなたのストーリボードが正しく準備される、そしてcellIdentifierがあなたのストーリーボードからの識別子と一致するならば、その時ダウンキャストは決して失敗しないはずです。

source: If your storyboard is set up correctly, none of these guard statements will fail.
ja: あなたのストーリーボードが正しく準備されるならば、これらのguardのうちどれも失敗しないでしょう。

source: If your text field looks like the one below, you’re ready to resize it; if it doesn’t, select it on the canvas.
ja: あなたのテキスト欄が下のもののように見えるならば、あなたはそれをリサイズする準備ができています；それがそう見えないならば、それをキャンバス上で選択してください。

source: If you’d like, use one of the other predefined UIColor values instead, like blue or green.
ja: あなたが好むならば、他の既定のUIColor値の内の１つを代わりに使ってください、blueやgreenのように。

source: If you’re running an app for the first time, Xcode asks whether you’d like to enable developer mode on your Mac.
ja: あなたがアプリを実行したのが初めてならば、Xcodeはあなたが開発者モードをあなたのMacで有効にしたいかどうかを尋ねます。

source: If you’re running into build issues, make sure the names of the images in your project exactly match the names you used in the code.
ja: あなたがビルド問題に出くわしているならば、あなたのプロジェクトの中の画像の名前が正確にあなたがコードの中で使った名前と一致することを確かめてください。

source: If you’re running into build issues, try pressing Command-Shift-K to clean your project.
ja: あなたがビルド問題にぶつかっているならば、コマンド-シフト-Kを押してあなたのプロジェクトを掃除してみてください。

source: Implement Edit and Delete Behavior
ja: 編集および削除挙動の実装

source: Implement Navigation
ja: ナビゲーションの実装

source: Implement a Custom Control
ja: カスタムコントロールの実装

source: Implement an initializer on a custom class
ja: カスタムクラス上でイニシャライザを実装する

source: Implement the Button Action
ja: ボタンアクションの実装

source: Implicitly unwrapped optionals are optionals, but the system implicitly unwraps them for you.
ja: 暗黙的にアンラップされるオプショナルはオプショナルです、しかしシステムは暗黙的にそれらをあなたの代わりにアンラップします。

source: Important
ja: 重要

source: In FoodTrackerTests.swift, you don’t need to use any of the template’s stub methods for this lesson.
ja: FoodTrackerTests.swiftにおいて、あなたはテンプレートの持つスタブメソッドの何もこのレッスンのために必要としません。

source: In Meal.swift, before the last curly brace (}), add the following:
ja: Meal.swiftにおいて、最後の波括弧（}）の前で、以下を加えてください：

source: In Meal.swift, below the //MARK: Properties section, add this code:
ja: Meal.swiftにおいて、//MARK: Properties節の下で、このコードを加えてください：

source: In Meal.swift, below the //MARK: Properties section, add this structure:
ja: Meal.swiftにおいて、//MARK: Properties節の下で、この構造体を加えてください：

source: In Meal.swift, find the class line:
ja: Meal.swiftにおいて、class行を見つけてください：

source: In Meal.swift, find the init?(name:, photo:, rating:) method.
ja: Meal.swiftにおいて、init?(name:, photo:, rating:)メソッドを見つけてください。

source: In MealTableViewCell.swift, find the class line, which should look like this:
ja: MealTableViewCell.swiftにおいて、class行を見つけてください、それはこのように見えるはずです：

source: In MealTableViewController.swift, before the last curly brace (}), add the following method:
ja: MealTableViewController.swiftにおいて、最後の波括弧（}）の前で、以下のメソッドを加えてください：

source: In MealTableViewController.swift, find and uncomment the prepareForSegue(_:sender:) method.
ja: MealTableViewController.swiftにおいて、prepareForSegue(_:sender:)メソッドを見つけてコメントを外してください。

source: In MealTableViewController.swift, find and uncomment the tableView(_:canEditRowAt:) method.
ja: MealTableViewController.swiftにおいて、tableView(_:canEditRowAt:)メソッドを見つけてコメントを外してください。

source: In MealTableViewController.swift, find and uncomment the tableView(_:cellForRowAt:) data source method.
ja: MealTableViewController.swiftにおいて、tableView(_:cellForRowAt:)データソースメソッドを見つけてコメントを外してください。

source: In MealTableViewController.swift, find and uncomment the tableView(_:commit:forRowAt:) method.
ja: MealTableViewController.swiftにおいて、tableView(_:commit:forRowAt:)メソッドを見つけてコメントを外してください。

source: In MealTableViewController.swift, find the numberOfSections(In:) data source method.
ja: MealTableViewController.swiftにおいて、numberOfSections(In:)データソースメソッドを見つけてください。

source: In MealTableViewController.swift, find the tableView(_:commit:forRowAt:) method:
ja: MealTableViewController.swiftにおいて、tableView(_:commit:forRowAt:)メソッドを見つけてください：

source: In MealTableViewController.swift, find the tableView(_:numberOfRowsInSection:) data source method.
ja: MealTableViewController.swiftにおいて、tableView(_:numberOfRowsInSection:)データソースメソッドを見つけてください。

source: In MealTableViewController.swift, find the unwindToMealList(sender:) action method:
ja: MealTableViewController.swiftにおいて、unwindToMealList(sender:)アクションメソッドを見つけてください：

source: In MealTableViewController.swift, find the unwindToMealList(sender:) method.
ja: MealTableViewController.swiftにおいて、unwindToMealList(sender:)メソッドを見つけてください。

source: In MealTableViewController.swift, find the viewDidLoad() method.
ja: MealTableViewController.swiftにおいて、viewDidLoad()メソッドを見つけてください。

source: In MealTableViewController.swift, find the viewDidLoad() method:
ja: MealTableViewController.swiftにおいて、viewDidLoad()メソッドを見つけてください：

source: In MealViewController.swift, above the //MARK: Actions section, add the following:
ja: MealViewController.swiftにおいて、//MARK: Actions節の上に、以下を加えてください：

source: In MealViewController.swift, find the //MARK: UITextFieldDelegate section.
ja: MealViewController.swiftにおいて、//MARK: UITextFieldDelegate節を見つけてください。

source: In MealViewController.swift, find the cancel(_:) action method.
ja: MealViewController.swiftにおいて、cancel(_:)アクションメソッドを見つけてください。

source: In MealViewController.swift, find the viewDidLoad() method.
ja: MealViewController.swiftにおいて、viewDidLoad()メソッドを見つけてください。

source: In MealViewController.swift, find the class declaration line:
ja: MealViewController.swiftにおいて、次のクラス宣言行を探してください：

source: In RatingControl.swift, add the following properties to the bottom of the //MARK: Properties section:
ja: RatingControl.swiftにおいて、以下のプロパティを//MARK: Propertiesセクションのボタンに加えてください：

source: In RatingControl.swift, after the //MARK Initialization section, add the following:
ja: RatingControl.swiftにおいて、//MARK Initializationセクションの後、以下を加えてください：

source: In RatingControl.swift, before the last curly brace (}), add the following method:
ja: RatingControl.swiftにおいて、最後の波括弧（}）の前に、以下のメソッドを加えてください：

source: In RatingControl.swift, delete the comments that come with the template implementation so you can start working with a blank slate.
ja: RatingControl.swiftにおいて、ひな形実装に付いてくるコメントを削除してください、それであなたは白紙の状態で作業を始めることができます。

source: In RatingControl.swift, find the ratingButtonTapped(button:) method:
ja: RatingControl.swiftにおいて、ratingButtonTapped(button:)メソッドを見つけてください：

source: In RatingControl.swift, find the setupButtons() method, and add a for-in loop around the method’s contents, like this:
ja: RatingControl.swiftにおいて、setupButtons()メソッドを見つけてください、for-inループをこのメソッドの内容の周りに加えてください、このように：

source: In RatingControl.swift, find the class declaration line:
ja: RatingControl.swiftにおいて、クラス定義行を見つけてください：

source: In RatingControl.swift, find the class declaration:
ja: RatingControl.swiftにおいて、クラス宣言を見つけてください：

source: In RatingControl.swift, modify the inspectable properties as shown below:
ja: RatingControl.swiftにおいて、調査可能なプロパティを以下に示すように修正してください：

source: In RatingControl.swift, navigate to the setupButtons() method, and add this code just above the for-in loop that creates the buttons:
ja: RatingControl.swiftにおいて、setupButtons()メソッドに進み、このコードをボタンを作成するfor-inループのすぐ上に加えてください：

source: In RatingControl.swift, navigate to the setupButtons() method.
ja: RatingControl.swiftにおいて、setupButtons()メソッドに進んでください。

source: In RatingControl.swift, under the class line, add this comment.
ja: RatingControl.swiftにおいて、class行の下で、このコメントを加えてください。

source: In RatingControl.swift, under the initializer methods, add this comment.
ja: RatingControl.swiftにおいて、そのイニシャライザメソッドの下で、このコメントを加えてください。

source: In ViewController.swift, after the textFieldShouldReturn(_:) method, add the following method:
ja: ViewController.swiftにおいて、textFieldShouldReturn(_:)メソッドの後に、以下のメソッドを加えます：

source: In ViewController.swift, delete the setDefaultLabelText(_:) action method.
ja: ViewController.swiftにおいて、setDefaultLabelText(_:)アクションメソッドを削除してください。

source: In ViewController.swift, find the class line, which should look like this:
ja: ViewController.swiftにおいて、class行を見つけたください、それはこのように見えるはずです：

source: In ViewController.swift, find the mealNameLabel outlet and delete it.
ja: ViewController.swiftにおいて、mealNameLabelアウトレットを見つけてそれを削除してください。

source: In ViewController.swift, find the selectImageFromPhotoLibrary(_:) action method you added earlier.
ja: ViewController.swiftにおいて、あなたが定義したselectImageFromPhotoLibrary(_:)アクションメソッドを見つけてください。

source: In ViewController.swift, find the setDefaultLabelText action method you just added.
ja: ViewController.swiftにおいて、あなたが加えたばかりのsetDefaultLabelTextアクションメソッドを見つけてください。

source: In ViewController.swift, find the textFieldDidEndEditing(_:) method.
ja: ViewController.swiftにおいて、textFieldDidEndEditing(_:)メソッドを見つけてください。

source: In ViewController.swift, find the viewDidLoad() method, which should look like this:
ja: ViewController.swiftにおいて、viewDidLoad()メソッドを見つけてください、それはこのように見えるはずです：

source: In ViewController.swift, just above the last curly brace (}), add the following:
ja: ViewController.swiftにおいて、最後の波括弧（}）のすぐ上に、以下を加えます：

source: In ViewController.swift, right above the //MARK: Actions section, add the following:
ja: ViewController.swiftにおいて、//MARK: Actions部分のちょうど上に、以下を加えてください：

source: In Start Developing iOS Apps (Swift), you learned the basics of iOS app development.
ja: このiOSアプリ開発を始めよう（Swift）において、あなたはiOSアプリ開発の基本を学びました。

source: In Auto Layout, a rule that explains where one element should be located relative to another, what size it should be, or which of two elements should shrink first when something reduces the space available for each of them.
ja: 自動レイアウトにおいて、ある要素が別のものと相対して位置するべきところ、どんな大きさでそれがあるべきか、または２つの要素のどちらが最初に、何かがそれらの各々のために役立てられる空間を減らすときに縮小されるべきかを明らかにするある規則。

source: In Interface Builder, you can configure a view controller’s navigation item by editing the navigation bar in the view controller’s scene.
ja: Interface Builderにおいて、あなたはビューコントローラの持つナビゲーション項目を、ナビゲーションバーをビューコントローラの持つシーンにおいて編集することで構成設定します。

source: In Swift, AnyObject is a type used to describe an object that can belong to any class.
ja: Swiftでは、AnyObjectはどんなクラスにも属することができるオブジェクトを記述するために使われる型です。

source: In Swift, you can represent the name using a String, the photo using a UIImage, and the rating using an Int.
ja: Swiftでは、あなたは名前をStringを使って、写真はUIImageを使って、そして格付けはIntを使って表すことができます。

source: In Xcode, a jump menu that lets you navigate directly to a specific declaration or section in a source code file.
ja: Xcodeにおいて、あなたを直接にソースコードファイルの特定の宣言または部門に進ませるジャンプメニュー。

source: In Xcode, a secondary editor window that appears side-by-side with your primary editor.
ja: Xcoceにおける、ある副次的エディタウインドウ、それはあなたの主要エディタの横に現れます。

source: In a production app, any String that can be seen by the user (such as the text field’s placeholder text) should be localized.
ja: 製品アプリにおいて、何らかのStringで、ユーザによって見られることができるもの（例えばテキスト欄のプレースホルダテキスト）は、ローカライズされるべきです。

source: In a storyboard, a scene represents one screen of content and typically one view controller.
ja: ストーリーボードにおいて、あるシーンは１つのコンテンツ画面と、大抵は１つのビューコントローラを表します。

source: In a storyboard, each scene contains views managed by that a view controller, and any items added to the controller or its views (for example, Auto Layout constraints).
ja: ストーリーボードにおいて、各シーンはそのビューコントローラによって管理されるいくらかのビュー、そしてそのコントローラまたはそれのビューに加えられるあらゆる項目（例えば、様々なAuto Layout制約など）を含みます。

source: In a storyboard, you can configure a table view to display static data (supplied in the storyboard) or dynamic data (programmatically supplied by the table view controller).
ja: ストーリーボードにおいて、あなたはテーブルビューを構成設定することで静的データ（ストーリーボードの中で提供される）または動的データ（プログラケ的にテーブルビューコントローラによって提供される）を表示できます。

source: In an app, the first responder is an object that is first on the line for receiving many kinds of app events, including key events, motion events, and action messages, among others.
ja: あるアプリにおいて、ファーストレスポンダは、特にキーイベント、モーションイベント、そしてアクションイベントを含めた、多くの種類のアプリイベントの受け取りの列の最初のオブジェクトです。

source: In an unmodified Single View Application template, the launch screen and the main interface are identical.
ja: 変更なしのSingle View Applicationテンプレートでは、起動画面とメインインターフェイスは同一です。

source: In both cases, the root cause is the same.
ja: 両方の場合において、根本的原因は同じです。

source: In fact, if you recall, you’ve already written some code in the viewDidLoad() method of ViewController:
ja: 実際、あなたが思い出すならば、あなたはすでにいくつかのコードをViewControllerのviewDidLoad()メソッドにおいて書いています：

source: In fact, the table view is the controller’s content view, and fills the entire space available to the scene.
ja: 実際には、テーブルビューは、そのコントローラの持つコンテンツビューです、そしてそのシーンで利用可能な空間全体を満たします。

source: In fact, there are two other indications that something might be wrong.
ja: 事実、何か間違っているかもしれないことを指し示すものが他に２つあります。

source: In fact, you’ve already worked with both views (labels, image views) and controls (text fields, buttons) in your interface.
ja: 実際、あなたはすでにビュー（ラベル、イメージビュー）とコントロール（テキスト欄、ボタン）の両方をあなたのインターフェイスで扱っています。

source: In general, each scene has its own view hierarchy.
ja: 一般に、各シーンはそれ自身のビュー階層を持ちます。

source: In iOS 10 and later, you must provide a photo library usage description.
ja: iOS 10以降では、あなたはフォトライブラリ使用説明を提供しなければなりません。

source: In later lessons, you will use model objects in your app’s code to create and manage the list of meals.
ja: 後のレッスンにおいて、あなたはモデルオブジェクトをあなたのアプリのコードで使って、食事のリストを作成して管理します。
